app/views/users/show.html.erb

<ul>
  <% @user.posts.each do |post|  %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1

<ul>
  <% @user.comments.each do |comment|  %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1