app/views/posts/show.html.erb

<ul>
  <% @post.comments.reload.each do |comment|  %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1