app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params[:comment])
    @comment.post_id = @post.id
    @comment.user_id = 1

      if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "and the 9ers"], ["created_at", Tue, 19 Mar 2013 16:08:43 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 19 Mar 2013 16:08:43 UTC +00:00], ["user_id", 1]]