app/controllers/posts_controller.rb

  def create
  	@post = Post.create(params[:post])
    @post.user_id = 1
    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["body", nil], ["created_at", Sun, 17 Mar 2013 23:05:09 UTC +00:00], ["title", nil], ["updated_at", Sun, 17 Mar 2013 23:05:09 UTC +00:00], ["url", nil], ["user_id", nil]]
UPDATE "posts" SET "user_id" = 1, "updated_at" = '2013-03-22 18:51:58.350722' WHERE "posts"."id" = 13